/* хуй его знает как обьяснить, но короче эта тема вылазит типа как в потверждении чего-то на сайте */
alert('Hello, World!');
/* коментарий который добавляется в консоль */
console.log('Собщение в консоль');

/* ---------------------------- */

/*! важно то что бы вывести какое-то изменение нужно прописать сначала 
то что будет выводиться на экран, а потом уже то что изменит уже, пример снизу */

let userName = 'главная часть'; // (let) - это переменная, которая может изменяться
console.log(userName); // изменяем переменную
userName = 1;
console.log(userName); // выводим измененную переменную

/* ---------------------------- */

const constValue = 10; // (const) - это константа, которая не может изменяться
